home_money.ДомашняяБухгалтерияДополнение/src/DataProcessors/ДБ_РабочееМестоПреподавателя/ДБ_РабочееМестоПреподавателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДБ_РабочееМестоПреподавателя</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>Ученик</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расписание</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ученик</name>
      <type>
        <types>CatalogRef.Контакты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проведено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторЗанятия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

home_money.ДомашняяБухгалтерияДополнение/src/InformationRegisters/ДБ_ПланыЗанятий/ДБ_ПланыЗанятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДБ_ПланыЗанятий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УченикГруппа</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗанятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

home_money.ДомашняяБухгалтерияДополнение/src/DataProcessors/ДБ_РабочееМестоПреподавателя/Forms/ФормаДобавленияУченика/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Заполнение дней недели
	ЗаполнитьДниНедели();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьУченикаИСформироватьРасписание(Команда)
	ПараметрыЗакрытия = ДобавитьУченикаИСформироватьРасписаниеНаСервере();
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры

&НаСервере
Функция ДобавитьУченикаИСформироватьРасписаниеНаСервере()
	// Добавить ученика
	Родитель = Константы.ДБ_ГруппаКонтактов.Получить();
	УченикОбъект = Справочники.Контакты.СоздатьЭлемент();
	УченикОбъект.Наименование = Наименование;
	УченикОбъект.Родитель = Родитель;
	УченикОбъект.Активность = Истина;
	УченикОбъект.Записать();
	Ученик = УченикОбъект.Ссылка;
	
	// Добавление уровня владения языков
	ЗаписьУровеньВладения = РегистрыСведений.ДБ_УровниВладенияЯзыкомУчеников.СоздатьМенеджерЗаписи();
	ЗаписьУровеньВладения.Период = ТекущаяДатаСеанса();
	ЗаписьУровеньВладения.УченикГруппа = Ученик;
	ЗаписьУровеньВладения.УровеньВладенияЯзыком = УровеньВладения;
	ЗаписьУровеньВладения.Записать();
	
	// Добавление цены занятия
	ЗаписьЦенаЗанятия = РегистрыСведений.ДБ_ЦеныЗанятий.СоздатьМенеджерЗаписи();
	ЗаписьЦенаЗанятия.Период = ТекущаяДатаСеанса();
	ЗаписьЦенаЗанятия.УченикГруппа = Ученик;
	ЗаписьЦенаЗанятия.Цена = ЦенаЗанятия;
	ЗаписьЦенаЗанятия.Записать();

	// Создание предварительного расписания
	СформироватьРасписание(Ученик);
	ДБ_РаботаСКалендарем.СинхронизироватьРасписаниеСКалендарем();
	
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("Ученик", Ученик);
	ПараметрыЗаписи.Вставить("ОбновитьРасписание", Истина);
	
	Возврат ПараметрыЗаписи;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДниНедели()
	НоваяЗапись = СписокДней.Добавить();
	НоваяЗапись.Значение = 1;
	НоваяЗапись.Представление = "Понедельник";
	НоваяЗапись = СписокДней.Добавить();
	НоваяЗапись.Значение = 2;
	НоваяЗапись.Представление = "Вторник";
	НоваяЗапись = СписокДней.Добавить();
	НоваяЗапись.Значение = 3;
	НоваяЗапись.Представление = "Среда";
	НоваяЗапись = СписокДней.Добавить();
	НоваяЗапись.Значение = 4;
	НоваяЗапись.Представление = "Четверг";
	НоваяЗапись = СписокДней.Добавить();
	НоваяЗапись.Значение = 5;
	НоваяЗапись.Представление = "Пятница";
	НоваяЗапись = СписокДней.Добавить();
	НоваяЗапись.Значение = 6;
	НоваяЗапись.Представление = "Суббота";
	НоваяЗапись = СписокДней.Добавить();
	НоваяЗапись.Значение = 7;
	НоваяЗапись.Представление = "Воскресенье";
КонецПроцедуры

&НаСервере
Процедура СформироватьРасписание(Ученик)
	ТекДата = НачалоДня(ТекущаяДатаСеанса());
	Сутки = 86400; 
	КоличествоДнейПланирования = 2592000;	// 30 * Сутки 
	ДатаНачалаЗанятий = Макс(ПериодПроведенияЗанятий.ДатаНачала, ТекДата);
	ДатаОкончанияЗанятий = ПериодПроведенияЗанятий.ДатаОкончания;
	Если НЕ ЗначениеЗаполнено(ДатаОкончанияЗанятий) Тогда
		// Дата окончания не известна, расписание составляем на месяц
		ДатаОкончанияЗанятий = КонецДня(ТекДата + КоличествоДнейПланирования);
	КонецЕсли;
	
	ДатаЗанятия = ДатаНачалаЗанятий;
	Пока ДатаЗанятия < ДатаОкончанияЗанятий Цикл
		ДеньНеделиКалендарь = ДеньНедели(ДатаЗанятия);
		Для Каждого ДеньНедели Из СписокДней Цикл
			Если ДеньНедели.Пометка И ДеньНедели.Значение = ДеньНеделиКалендарь Тогда
				ДобавитьЗаписьПланирования(Ученик, НачалоДня(ДатаЗанятия));
			КонецЕсли;
		КонецЦикла;
		ДатаЗанятия = ДатаЗанятия + Сутки; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписьПланирования(Ученик, ДатаЗанятия)
	ЗаписьПланЗанятий = РегистрыСведений.ДБ_ПланыЗанятий.СоздатьМенеджерЗаписи();
	ЗаписьПланЗанятий.Период = ТекущаяДатаСеанса();
	ЗаписьПланЗанятий.УченикГруппа = Ученик;
	ЗаписьПланЗанятий.ДатаЗанятия = ДатаЗанятия;
	ЗаписьПланЗанятий.КоличествоЧасов = КоличествоЧасов;
	ЗаписьПланЗанятий.ВремяПроведения = ДБ_РаботаСКалендарем.ПреобразоватьАкадемическиеЧасыВАстрономические(КоличествоЧасов);
	ЗаписьПланЗанятий.ДатаНачала = ДатаЗанятия + (ВремяНачалаЗанятия - Дата(1, 1, 1));
	ЗаписьПланЗанятий.ДатаОкончания = ЗаписьПланЗанятий.ДатаНачала + (ЗаписьПланЗанятий.ВремяПроведения - Дата(1, 1, 1));
	ЗаписьПланЗанятий.Записать();
КонецПроцедуры

#КонецОбласти
